/**
  ******************************************************************************
  * @file    myiic_upper.c
  * @author  zsq
  * @version
  * @date    
  * @brief   none
  *
  ******************************************************************************
*/  
  
#define MYIIC_GLOBALS  

#include "myiic_upper.h"  

//---call some task/module--- 
#include "myiic_m24c64_method.h"


/*******************************************************************************
 * @brief   myiic_read_24c64_api
 *
 * @param   
 *
 * @retval  
 *
 * @note    none
 *****************************************************************************/
int myiic_read_24c64_api(u16 addr, u16 lenth,u8 *redbuf)
{
    device_m24C64_read(addr,redbuf,lenth);     // 读取指定地址数据
    return 1;
}

/*******************************************************************************
 * @brief   myiic_write_24c64_api
 *
 * @param   
 *
 * @retval  
 *
 * @note    none
 *****************************************************************************/
int myiic_write_24c64_api(u16 addr, u16 lenth,u8 *pbuf)
{
    device_m24C64_write(addr,pbuf,lenth);      // M24C64-iic写入数据
    return 1;
}

/*******************************************************************************
 * @brief   Myiic_init_api
 *
 * @param   
 *
 * @retval  
 *
 * @note    none
 *****************************************************************************/
void Myiic_init_api(void)
{
    Bsp_My_IIC_Init();                                    // 初始化IIC
}

/*******************************************************************************
 * @brief   
 *
 * @param   
 *
 * @retval  
 *
 * @note    none
 *****************************************************************************/



